[Demo_Destiny_ep7_3_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-1502,Y=882,Z=1335),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=0,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Vec=(X=225,Y=-195,Z=-300),VecSub=(X=90,Y=0,Z=0),CId=72)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0000_lp_open_normal",motionName[1]="kr_CM_0003_fx_close_smile_L",motionName[2]="kr_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=AMBIENT,Command=PLAY,SecTime=1,SoundID=SoundCue'AMB_Rooftop.GG2_AMB_Rooftop_LP_Cue')
DemoScripts[7]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[8]=(Actor=FADE,Command=WAIT)
DemoScripts[9]=(Actor=WINDOW,Command=SET)
DemoScripts[10]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[11]=(Actor=WINDOW,Command=EXIT)
DemoScripts[12]=(Actor=ROOT,Command=SELECT_DESTINY_GIRL)
DemoScripts[13]=(Actor=ROOT,Command=SELECT_DESTINY_GIRL_WAIT)
DemoScripts[14]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=-1302,Y=882,Z=1335),SecTime=2)
DemoScripts[15]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[16]=(Actor=FADE,Command=WAIT)
DemoScripts[17]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=225,Y=1170,Z=1335),SecTime=)
DemoScripts[18]=(Actor=CHARACTER,Command=SET,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',SetType=POS,Vec=(X=225,Y=980,Z=1200),CId=72)
DemoScripts[19]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[20]=(Actor=FADE,Command=WAIT)
DemoScripts[21]=(Actor=WINDOW,Command=SET)
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[23]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[24]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[25]=(Actor=BGM,Command=PLAY,SecTime=1,SoundID=SoundCue'GG2_BGM_DM_CMN_Uneasy.GG2_BGM_DM_CMN_Uneasy_Cue')
DemoScripts[26]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_3.GG2_V_DES_ep7_3_003_Cue',Name="")
DemoScripts[27]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[28]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[29]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[30]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_3.GG2_V_DES_ep7_3_005_Cue',Name="クロナ")
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[32]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[33]=(Actor=WINDOW,Command=EXIT)
DemoScripts[34]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[35]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=0.5)
DemoScripts[36]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[37]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[38]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Trick.GG2_BGM_DM_CMN_Trick_Cue')
DemoScripts[39]=(Actor=WINDOW,Command=SET)
DemoScripts[40]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[41]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0100_fx_close_normal",motionName[1]="kr_CM_0003_fx_close_smile_L",motionName[2]="kr_DM_0102_fx_Stand2Proud",Rate=0,Number=3,Bit=0)
DemoScripts[42]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[2]="kr_DM_0200_lp_Proud",Number=8)
DemoScripts[43]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_3.GG2_V_DES_ep7_3_007_Cue',Name="クロナ")
DemoScripts[44]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[45]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[46]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_3.GG2_V_DES_ep7_3_008_Cue',Name="")
DemoScripts[47]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[48]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[49]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0001_lp_open_angry",motionName[1]="kr_CM_0003_fx_close_smile_L",motionName[2]="kr_DM_0201_fx_Proud2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[50]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[2]="kr_DM_0100_lp_Stand",Number=8)
DemoScripts[51]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_3.GG2_V_DES_ep7_3_009_Cue',Name="クロナ")
DemoScripts[52]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[53]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[54]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[55]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0101_fx_close_smile",Rate=0,Number=0,Bit=0)
DemoScripts[56]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_3.GG2_V_DES_ep7_3_011_Cue',Name="クロナ")
DemoScripts[57]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[58]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[59]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0001_lp_open_angry",motionName[1]="kr_CM_0003_fx_close_smile_L",motionName[2]="kr_DM_0102_fx_Stand2Proud",Rate=0,Number=3,Bit=1)
DemoScripts[60]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[2]="kr_DM_0200_lp_Proud",Number=8)
DemoScripts[61]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep7_3.GG2_V_DES_ep7_3_012_Cue',Name="クロナ")
DemoScripts[62]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[63]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[64]=(Actor=WINDOW,Command=EXIT)
DemoScripts[65]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[66]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[67]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[68]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[69]=(Actor=SYSTEM,Command=END)

[Select_Destiny_ep7_3_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Destiny_ep7_3_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="我命運的對象就在這裡......")

Texts[1]=(Label="TEXT02",Name="峯大",Text="......咦,奇怪?")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="沒有人耶....../n是我們太早到了嗎?")

Texts[3]=(Label="TEXT04",Name="峯大",Text="還是她已經回去了......?")

Texts[4]=(Label="TEXT05",Name="庫蘿娜",Text="噫嘻嘻嘻!/n你們終於來了DEATH啊!/n人類! 傻瓜天使!")

Texts[5]=(Label="TEXT06",Name="峯大",Text="妳是......那時的惡魔!?")

Texts[6]=(Label="TEXT07",Name="庫蘿娜",Text="我知道你們偷偷摸摸地/n在做些什麼DEATH!")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="才沒有偷偷摸摸!")

Texts[8]=(Label="TEXT09",Name="庫蘿娜",Text="在這裡等著你的人類/n已經被庫蘿娜大人/n捉起來了DEATH!!")

Texts[9]=(Label="TEXT10",Name="峯大",Text="咦咦!?")

Texts[10]=(Label="TEXT11",Name="庫蘿娜",Text="想把人要回去的話/n就來搶搶看DEATH!")

Texts[11]=(Label="TEXT12",Name="庫蘿娜",Text="來吧DEATH!/n我的僕人啊!!")

Texts[12]=(Label="",Name="",Text="")

Texts[13]=(Label="SELECT01",Name="",Text="")

Texts[14]=(Label="SELECT02",Name="",Text="")

Texts[15]=(Label="SELECT03",Name="",Text="")

Texts[16]=(Label="SELECT04",Name="",Text="")

Texts[17]=(Label="SELECT05",Name="",Text="")

Texts[18]=(Label="SELECT06",Name="",Text="")

Texts[19]=(Label="SELECT07",Name="",Text="")

Texts[20]=(Label="SELECT08",Name="",Text="")

Texts[21]=(Label="SELECT09",Name="",Text="")

Texts[22]=(Label="SELECT10",Name="",Text="")


